Revit 2024 API
BackClippingParam Enumeration
 The allowed values for the VIEW_BACK_CLIPPING and VIEWER_BOUND_FAR_CLIPPING parameters.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public enum BackClippingParam
Visual Basic
Public Enumeration BackClippingParam
Visual C++
public enum class BackClippingParam
Members
Member name | Description
NoClip |  No clip
ClipWithLine |  Clip with line.
ClipNoLine |  Clip without line.
See Also
Autodesk.Revit.DB Namespace